{
  "about": {
    "greeting": "Merhaba, Ben Cansu Altun",
    "title": "Frontend Developer",
    "bio": {
      "first": "Frontend geliştirme konusunda tutkulu bir yazılımcıyım. Modern web teknolojilerini kullanarak kullanıcı dostu ve performanslı uygulamalar geliştiriyorum. React, Next.js ve TypeScript ekosisteminde uzmanlaşıyorum.",
      "second": "Yazılım geliştirme yolculuğuma 2021 yılında başladım. O zamandan beri sürekli kendimi geliştiriyor ve yeni teknolojileri öğreniyorum. Kullanıcı deneyimini ön planda tutarak, temiz ve sürdürülebilir kod yazmaya özen gösteriyorum.",
      "third": "Boş zamanlarımda açık kaynak projelere katkıda bulunuyor, teknoloji blogları okuyor ve yeni web teknolojilerini deneyimliyorum. Ayrıca Modern danslarla ile aktif olarak ilgileniyorum."
    },
    "skills": "Teknik Yetenekler"
  },
  "experience": {
    "title": "İş Deneyimlerim",
    "companies": {
      "profen": {
        "title": "Uzman Yazılım Mühendisi",
        "subtitle": "Full Time",
        "description": "Savunma sanayi ve telekomünikasyon alanında faaliyet gösteren Profen’de, frontend ağırlıklı olmak üzere kullanıcı arayüzleri geliştiriyor ve gerçek zamanlı veri işleyen sistemlerde görev alıyorum. React ve TypeScript gibi modern teknolojilerle güvenli, performanslı ve kullanıcı dostu uygulamalar geliştiriyorum. Yazılım yaşam döngüsünün tüm aşamalarında aktif rol alarak, yüksek güvenlik standartlarına uygun çözümler üretiyorum."
      },
      "hexaworks": {
        "title": "Yazılım Geliştirici",
        "subtitle": "Tam Zamanlı",
        "description": "Hexaworks'te, performans ve kullanıcı deneyimi odaklı ölçeklenebilir web çözümleri geliştirmek üzere, micro frontend mimarisi ve modern frameworkler kullanarak yenilikçi projeler yürütüyorum. Geliştirme süreçlerinde Typescript, React ve Next.js gibi ileri düzey teknolojiler ile kullanıcı dostu ve yüksek performanslı dijital deneyimler sunmayı hedefliyoruz."
      },
      "primetech": {
        "title": "Frontend Geliştirici",
        "subtitle": "Tam Zamanlı",
        "description": "Müşteri odaklı, modüler web siteleri ve mobil uygulamalar üzerinde çalıştım."
      },
      "kolayyolculuk": {
        "title": "Frontend Geliştirici Stajyer",
        "subtitle": "Stajyer",
        "description": "Kullanıcı deneyimini ön planda tutarak, responsive tasarım ve tarayıcı uyumluluğu alanlarında pratik yaptım. React ve Bootstrap kullanarak dinamik arayüzlerin geliştirilmesine destek verdim ve projelerde yazılım geliştirme süreçlerini daha yakından gözlemleme fırsatı buldum."
      }
    }
  },
  "contact": {
    "title": "İletişime Geçin",
    "subtitle": "Sorularınız veya projeleriniz için benimle iletişime geçebilirsiniz.",
    "form": {
      "name": {
        "label": "İsminiz",
        "placeholder": "Adınız Soyadınız"
      },
      "email": {
        "label": "Email Adresiniz",
        "placeholder": "ornek@email.com"
      },
      "subject": {
        "label": "Konu",
        "placeholder": "Mesajınızın konusu"
      },
      "message": {
        "label": "Mesajınız",
        "placeholder": "Mesajınızı buraya yazın"
      },
      "submit": {
        "default": "Mesaj Gönder",
        "loading": "Gönderiliyor..."
      }
    },
    "toast": {
      "loading": "Mesajınız gönderiliyor...",
      "success": {
        "title": "Mesajınız başarıyla gönderildi!",
        "description": "En kısa sürede size dönüş yapacağım."
      },
      "error": {
        "title": "Bir hata oluştu!",
        "description": "Lütfen daha sonra tekrar deneyin."
      }
    }
  },
  "projects": {
    "my_project": "Projelerim",
    "project_description": "Geliştirdiğim bazı projeler ve çalışmalar",
    "show_less": "Daha az göster",
    "see_more": "Daha fazla göster",
    "budget_tracker": {
      "name": "Bütçe Takipçisi",
      "description": "Gelir ve giderlerinizi kategorize ederek takip edebileceğiniz, görselleştirilmiş grafikler ve raporlar sunan modern bir bütçe yönetim uygulaması. React ve Next.js ile geliştirilmiş kullanıcı dostu arayüzü ile finansal kontrolü kolaylaştırır."
    },
    "draggable_store": {
      "name": "Sürükle & Bırak Mağazası",
      "description": "Özelleştirilebilir drag and drop arayüz tasarım aracı. Kullanıcılar kendi tasarımlarını sürükle-bırak yöntemiyle oluşturabilir, düzenleyebilir ve kaydedebilir. React ve TypeScript ile geliştirilmiş, modern ve sezgisel kullanıcı deneyimi sunan web uygulaması."
    }
  },
  "sidebar": {
    "about": "Hakkımda",
    "contact": "İletişim",
    "projects": "Projeler",
    "experience": "Deneyimlerim",
    "status": {
      "title": "İş Aramaya Açık",
      "subtitle": "Yeni fırsatlar için hazırım"
    }
  }
}
